tutorials/pimpleHFDIBFoam/Immersed_IB_Valves_in_Cube/Immersed-IB-Valves-Mesh200k/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  8
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}

// --------------------------- Global settings --------------------------------

bodyNames ("MV_Valve_Final" "AV_Valve_Final");

surfaceThreshold        1e-4;
stepDEM                 0.02;
geometricD              (1 1 1);
recordSimulation        true;
recordFirstTimeStep     false;
nSolidsInDomain         1000;
ibCouplingCoeff         0.2;

outputSetup
{
    basic        true;
    iB           false;
    DEM          false;
    addModel     true;
    parallelDEM  false;
}

virtualMesh
{
    level        2;
    charCellSize 0.0012;
}

// interpolationSchemes
// {
//     method  line;
//     U       cellPoint;
// }

interpolationSchemes
{
    method leastSquares;

    leastSquaresCoeffs
    {
        distFactor    1.0;
        radiusFactor  6.0;
        angleFactor   120.0;
        maxCCRows     25;
    }
}
// ------------------------------- DEM ----------------------------------------

DEM
{
    LcCoeff       4.0;
    rotationModel chen2012;

    materials
    {
        particle
        {
            Y     1e7;
            nu    0.3;
            mu    0.05;
            adhN  0;
            eps   0.5;
        }

        wall
        {
            Y     1e7;
            nu    0.2;
            mu    0;
            adhN  0;
            eps   0.5;
        }
    }

    // Mesh bounding box (from checkMesh):
    // (-0.00314206 -0.0619276 -0.0411181) (0.0472645 0.038652 0.00541275)
    // Using ε = 0.0005 → planes slightly inside the CFD box
    collisionPatches
    {
        wallXp
        {
            material   wall;
            nVec       (-1 0 0);
            planePoint ( 0.0467645 0 0 );
        }
        wallXm
        {
            material   wall;
            nVec       ( 1 0 0);
            planePoint (-0.00264206 0 0 );
        }
        wallYp
        {
            material   wall;
            nVec       (0 -1 0);
            planePoint (0  0.038152 0);
        }
        wallYm
        {
            material   wall;
            nVec       (0  1 0);
            planePoint (0 -0.0614276 0);
        }
        wallZp
        {
            material   wall;
            nVec       (0 0 -1);
            planePoint (0 0  0.00491275);
        }
        wallZm
        {
            material   wall;
            nVec       (0 0  1);
            planePoint (0 0 -0.0406181);
        }
    }
}

// ============================= MITRAL BODY ==================================

MV_Valve_Final
{
    rho   rho [1 -3 0 0 0 0 0] 1060;

    U { BC noSlip; }

    material        particle;
    staticBody;

    // STL-based geometry
    // STL Bounding Box (surfaceCheck):
    // (0.0241721 0.00125323 -0.0333112) (0.0430165 0.0194722 -0.00493661)
    bodyGeom        stlBased;
    stlBasedCoeffs
    {
        fileName "constant/triSurface/MV_Valve_Final.stl";
        // scale 1.0; translate (0 0 0); rotate (axis (0 0 1) angle 0);
    }

    sdBasedLambda   false;
    interfaceSpan   1.0;
    startSynced     false;
    refineBuffers   2;
    timesToSetStatic -1;

    // -------- Prescribed valve motion (MITRAL) --------
    deformingBody_mitral_ref
    {
        fixedEnd  top;
        period    1.0;
        timeLaw   twoWindow;

        //closeWindow (0.615 0.645);
	closeWindow (0.03 0.07);
        //openWindow  (0.950 1.000);
	openWindow  (0.12 0.17);
	

	//closeWindow (0.1 0.13);
	// openWindow  (0.20 0.25);

        Fmax          1;
        nearRamp      0.010;
        activeLen     0.016;
        spaceLaw      smootherstep;
        leafThickness 0.001;
        flipNormalTowardValve true;

        // Axis centres (your values)
        topCenter      (0.00371912 0.02042724 0.1279471 );
        bottomCenter   (0.00103005 0.00530772 0.12477971);

        mitralRefVelocityMode ibpointsonly; //off
    }

    // Required by your code path (no-op: adds nothing)
    bodyAddition
    {
        addModel           once;
        distributionCoeffs
        {
            addMode         boundBox;
            stlBaseSize     1e-5;
            addDomain       boundBox;
            boundBoxCoeffs
            {
                minBound (0 0 0);
                maxBound (0 0 0);
            }
        }
    }
}

// ============================= AORTIC BODY ==================================

AV_Valve_Final
{
    rho   rho [1 -3 0 0 0 0 0] 1060;

    U { BC noSlip; }

    material        particle;
    staticBody;

    // STL-based geometry
    // STL Bounding Box (surfaceCheck):
    // (0.00175082 0.0115397 -0.0280971) (0.0209459 0.0307861 -0.00941113)
    bodyGeom        stlBased;
    stlBasedCoeffs
    {
        fileName "constant/triSurface/AV_Valve_Final.stl";
    }

    sdBasedLambda   false;
    interfaceSpan   1.0;
    startSynced     false;
    refineBuffers   2;
    timesToSetStatic -1;

    // -------- Prescribed valve motion (AORTIC) --------
    deformingBody_mitral_ref
    {
        fixedEnd  bottom;
        period    1.0;
        timeLaw   threeWindow;

	//close1Window (0.000 0.010);
	//openWindow   (0.645 0.675);
	openWindow (0.07 0.10);
	//close2Window (0.950 1.000);
	close2Window (0.12 0.17);

	//close1Window (0.000 0.010);
        //openWindow   (0.13 0.16);
	// close2Window (0.20 0.25 );

        Fmax          1;
        nearRamp      0.010;
        activeLen     0.015;
        spaceLaw      smootherstep;
        leafThickness 0.001;
        flipNormalTowardValve true;

        // Axis centres (your values)
        topCenter      (-0.02341808  0.03117524  0.11971486);
        bottomCenter   (-0.01668424  0.0192603   0.12067945);

	mitralRefVelocityMode ibpointsonly;
    }

    // Required by your code path (no-op: adds nothing)
    bodyAddition
    {
        addModel           once;
        distributionCoeffs
        {
            addMode         boundBox;
            stlBaseSize     1e-5;
            addDomain       boundBox;
            boundBoxCoeffs
            {
                minBound (0 0 0);
                maxBound (0 0 0);
            }
        }
    }
}

// ************************************************************************* //
